Revit 2027 API
BendingDetailCustomFieldProperties.AngularDimensionsForCranksEnabled Property
 Identifies if the angular dimensions which has a reference set on a crank will be shown or not.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AngularDimensionsForCranksEnabled { get; set; }
Public Property AngularDimensionsForCranksEnabled As Boolean
	Get
	Set
public:
property bool AngularDimensionsForCranksEnabled {
	bool get ();
	void set (bool value);
}
member AngularDimensionsForCranksEnabled : bool with get, set
Property Value
Boolean
See Also
Reference
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace